Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཆོས་དབྱིངས་ཡངས་པ་རྒྱས་མཛད་ཅིང་། །འགྲོ་བའི་བསམ་པ་ཇི་བཞིན་འཁོར་ལོ་བསྐོར། །
en: He pervades the vast realm of phenomena, Turning the wheel in accordance with the aspirations of beings.

source: རྒྱལ་བས་ཆོས་ཉིད་ལུས་མེད་རབ་ཞི་བ། །གཉིས་མེད་རང་བཞིན་མེད་པ་ཐུགས་ཆུད་ནས། །
en: {3} “The Jina has realized the true nature, which is bodiless, Complete peace, nondual, with no own nature.

source: གཟུགས་སྐུ་བཟང་པོ་མཚན་གྱིས་བརྒྱན་པ་ཡིས། །འགྲོ་བ་མ་ལུས་བཀང་ཞིང་སྟོན་པ་མཛད། །
en: His physical body, beautiful and adorned by signs, Pervades and teaches in every world without exception.

source: སངས་རྒྱས་སྐུ་ནི་རྒྱ་ཆེ་བསམ་མི་ཁྱབ། །
en: {4} “The Buddha’s body is inconceivably vast.

source: ཆོས་ཀྱི་དབྱིངས་ཀུན་ཡོངས་སུ་རྒྱས་བཀང་ཞིང་། །
en: It fills the entirety of the realm of phenomena.

source: དེ་ནི་ཀུན་ཏུ་མཉམ་པར་སྣང་བ་སྟེ། །རྒྱལ་བ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པ་མཛད། །
en: It appears equally everywhere, Revealing all the jinas everywhere.

source: ཞིང་རྣམས་ཀུན་གྱི་རྡུལ་རབ་ཕྲ་བ་སྙེད། །འོད་ཀྱི་དཀྱིལ་འཁོར་མངའ་བའི་སངས་རྒྱས་སྐུ། །ཁ་དོག་བཟང་པོ་གཞན་དང་གཞན་སྣང་བས། །ཆོས་དབྱིངས་རྒྱས་པར་སྐད་ཅིག་རེ་རེས་འགེངས། །
en: {5} “Bodies of the Buddha, with halos of light, As numerous as the atoms in all realms, Their beautiful color appearing here and there, Fill the realm of phenomena in every instant.

source: རྒྱལ་བའི་བ་སྤུའི་སྒོ་ནས་འོད་ཟེར་སྤྲིན། །
en: {6} “Clouds of light rays appear from the Jina’s pores.

source: རྒྱ་ཆེ་བསམ་ཡས་མི་ཟད་མངོན་འབྱུང་བ། །
en: They are vast, inconceivable, and unending.

source: དེ་དག་འགྲོ་བ་མ་ལུས་འགེངས་བྱེད་ཅིང་། །སྲོག་ཆགས་རྣམས་ཀྱི་ཉོན་མོངས་གདུང་བ་སེལ། །
en: They fill every world without exception And dispel the torment of the kleśas in beings.

source: སངས་རྒྱས་སྤྲུལ་པ་རྒྱ་མཚོ་མི་ཟད་པ། །རྒྱལ་བའི་སྤུ་ཡི་འཁོར་ནས་ཡོངས་སྟོན་ཅིང་། །ཆོས་དབྱིངས་ཡངས་པ་རྒྱས་པར་ཀུན་བཀང་སྟེ། །སྲོག་ཆགས་རྣམས་ཀྱི་སྡུག་བསྔལ་ངན་སོང་སེལ། །
en: {7} “The Buddha’s inexhaustible ocean of emanations Appear from the circles of the Jina’s pores And spread and fill the vast realm of phenomena, Dispelling the suffering of beings in the lower realms.

source: སངས་རྒྱས་གསུང་སྙན་རབ་ཏུ་སྒྲོག་མཛད་པ། །དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་འོད་ཅན། །ཆོས་ཆར་ཆེན་པོ་རབ་ཏུ་འབེབས་པ་མཛད། །སྲོག་ཆགས་བྱང་ཆུབ་བསམ་པ་ཡོངས་སུ་སྐྱེད། །
en: {8} “The sound of the Buddha’s voice resounds With the light of an ocean of aspects of speech, Sending down a great rain of the Dharma, Causing the aspiration to enlightenment to grow in beings.

source: བསྐལ་པ་རྒྱ་མཚོ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །འདིས་ནི་སྔན་ཅད་ཡོངས་སུ་གཟུང་མཛད་པ། །
en: {9} “He has in the past taken care of those Practicing bodhisattva conduct during an ocean of kalpas.

source: དེ་དག་ཀུན་གྱི་རྒྱལ་བ་རྣམ་པར་སྣང་མཛད་པ། །ཞིང་རྣམས་ཀུན་ཏུ་གཟུགས་བརྙན་མཚན་ཉིད་མཐོང་། །
en: They have all seen in all the worlds The characteristics of the visual form of the Jina Vairocana.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ཀུན་ཏུ་འབྱུང་། །སེམས་ཅན་རེ་རེ་ཀུན་ལའང་མངོན་པར་བཞུགས། །མོས་པའི་ཚུལ་བཞིན་སྤྱོད་ཡུལ་གཞན་དང་གཞན། །དེ་དག་ཁོ་མོས་ཀུན་ཏུ་ཤེས་མི་ནུས། །
en: {10} “The Tathāgata has appeared in all worlds In the presence of each and every being With this and that conduct according to their aspirations, And those are beyond my ability to know.

source: རྒྱལ་སྲས་དམ་པ་ཐམས་ཅད་མ་ལུས་པར། །བདེ་གཤེགས་བ་སྤུ་གཅིག་གི་རྩེ་ལས་འབྱུང་། །
en: {11} “All the perfect bodhisattvas without exception Have appeared from a single pore of the Sugata.

source: རྣམ་ཐར་དེ་ལ་གང་རྣམས་བསམ་ཡས་པ། །དེ་དག་ཐམས་ཅད་ཁོ་མོས་ཤེས་མི་ནུས། །
en: That liberation is inconceivable And is beyond my ability to know.

source: ཁོ་མོའི་འདབ་ན་གནས་པའི་ལྷ་མོ་འདི། །འཇིག་རྟེན་མགོན་ལ་མངོན་གྱུར་རབ་ཏུ་དགའ། །
en: {12} “This goddess who is nearby to me Delights in the presence of the Lord of the World.

source: མིང་དུ་སྣང་བ་འོད་འཕྲོ་མིག་ཅེས་བྱ། །
en: Her name is Jyotirarci­nayanā.

source: དེ་ལ་བྱང་ཆུབ་སྤྱོད་པ་ཅི་འདྲ་དྲིས། །
en: Ask her, what is the practice for enlightenment!”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་བྱིན་གྱིས་བརླབས་པ། དགེ་བའི་བཤེས་གཉེན་གྱི། ཚིག་ལ་ནན་ཏན་དུ་བྱ་བའི་སེམས་ཡང་དག་པར་སྐྱེས་པ།
en: {13} Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Samanta­gambhīra­śrī­vimala­prabhā, circumambulated the night goddess Samanta­gambhīra­śrī­vimala­prabhā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Samanta­gambhīra­śrī­vimala­prabhā.

source: དགེ་བའི་གཤེས་གཉེན་གྱི་སྨན་པ་ལ་ནད་པ་ལྟ་བུའི་འདུ་ཤེས་ཀྱིས་ཡོངས་སུ་སྤྱད་པའི་སེམས་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ཡིད་ལ་བྱེད་པ་མ་འཁྲུགས་པའི་སེམས་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་བལྟ་བ་ལ་བསྒྲིབས་པའི་རི་ཐམས་ཅད་རྣམ་པར་གཏོར་བའི་གླགས་རྙེད་པའི་སེམས་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ལ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཐོབ་པའི་སེམས་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པའི་སེམས་དང་ལྡན་པ་དེ།
en: Pramudita­nayana­jagad­virocanā Chapter 36 Sudhana, the head merchant’s son, was blessed by the instruction of the kalyāṇamitra; his mind practiced the words of the kalyāṇamitra; his mind had the perception of the kalyāṇamitra as a physician and himself as a patient; his mind was contented by focusing on the vision of the kalyāṇamitra; his mind had obtained the opportunity to disperse the mountain of obscurations to the vision of the kalyāṇamitra; his mind had attained, through seeing the kalyāṇamitra, entry into the ocean of the ways of the great compassion that saves all the realms of beings; his mind had attained, through seeing the kalyāṇamitra, the illumination by wisdom of the ocean of the ways of the realm of phenomena.

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མྱིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་གང་ན་བ་དེར་སོང་ངོ་། །དེ་ནས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མྱིག་འགྲོ་བར་རྣམ་པར་སྣང་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དེ་བས་ཀྱང་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དགེ་བའི་རྩ་བའི་ཚོགས་ལས་བྱུང་བས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ཚོགས་ཆེན་པོ་ལས་བྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་རྣམ་པར་གནོན་པ་ཆེན་པོར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་བརྩོན་འགྲུས་ཀྱི་ལས་འཇུག་པར་དཀའ་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་བསྡད་ཅིང་ཤིན་ཏུ་ལེགས་པར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ཕྱོགས་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: Thus, he approached the night goddess Pramudita­nayana­jagad­virocanā.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ཡུན་རིང་པོར་གནས་པས་བྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དོན་མཐའ་ཡས་པ་ཡོངས་སུ་རྫོགས་པའི་རྣམ་པར་དམྱིགས་པ་འབྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ལམ་གྱི་རྒྱན་མཐའ་དང་དབུས་མེད་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་གནོན་པར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་སྒོ་ཀུན་ནས་རྣམ་པར་གནོན་པས་བྱུང་བར་བྱིན་གྱིས་བརླབས་སོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་གཡོ་བ་མེད་པར་འོང་བས་རྣམ་པར་གནོན་པར་བྱིན་གྱིས་བརླབས་སོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཐམས་ཅད་མཁྱེན་པའི་ཚོགས་ཀྱི་བརྩོན་འགྲུས་ལ་རབ་ཏུ་བརྩོན་པས། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོ་མངོན་པར་བསྒྲུབ་པའི་རྣམ་པར་གནོན་པས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་།
en: The night goddess Pramudita­nayana­jagad­virocanā, in order to further increase the ripening of his accumulation of the roots of merit through approaching a kalyāṇamitra, blessed approaching a kalyāṇamitra as arising from a great accumulation, blessed going to a kalyāṇamitra as great prowess, blessed approaching a kalyāṇamitra as diligence in actions that is difficult to realize, blessed approaching a kalyāṇamitra as reliance throughout a long time, blessed approaching a kalyāṇamitra as going into centerless and limitless directions, blessed approaching a kalyāṇamitra as the source for dwelling together for a long time, blessed approaching a kalyāṇamitra as the source of perceiving infinite tasks being completed, blessed approaching a kalyāṇamitra as the prowess of an accumulation of centerless and limitless displays of the path, blessed approaching a kalyāṇamitra as prowess through every gateway, and blessed approaching a kalyāṇamitra as the prowess of undeviating arrival.

source: སེམས་ཅན་གཅིག་གི་དོན་དུ་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་སྡུག་བསྔལ་ཉམས་སུ་བླང་བའི་ཞེ་ནོན་པས། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་སྒྲ་སྒྲོག་ཅིང་ཡུན་རིང་པོར་གནས་པའི་རྣམ་པར་གནོན་པ་དང་། བརྩོན་འགྲུས་ཆེན་པོའི་གོ་བགོས་པས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། ཕྱོགས་རྒྱ་མཚོ་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་ཤུགས་ཀྱིས་འགྲོ་བས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། བ་སྤུའི་སྦུབས་གཅིག་ཏུ་ཕྱི་མའི་མཐའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པས། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་ནས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འགེངས་པ་ལ་གནས་པར་བྱ་བས། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་དང་། ལམ་ཡོངས་སུ་གནོན་པར་ཞེ་ནོན་པས། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་གྱིས་རྒྱུན་ཏུ་ཞུགས་པའི་ལམ་ཡོངས་སུ་གནས་པས། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་དམིགས་པ་ལས་མ་གཡོས་པར། ཆོས་ཀྱི་དབྱིངས་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་གང་ན་བ་དེར་ཕྱིན་པ་དང་།
en: Sudhana, the head merchant’s son, approached the night goddess Pramudita­nayana­jagad­virocanā in this way: approaching a kalyāṇamitra with diligent dedication in the accumulation of omniscience; approaching a kalyāṇamitra with the prowess of accomplishing an ocean of great prayers; approaching a kalyāṇamitra with the resolve to undergo suffering for the sake of a single being until the conclusion of the last future kalpa; approaching a kalyāṇamitra with the prowess of remaining for a long time within a single atom, emitting sound throughout the entire realm of phenomena while wearing the armor of diligence; approaching a kalyāṇamitra while moving at great speed through the entire extent of the ocean of directions; approaching a kalyāṇamitra while maintaining all bodhisattva conduct of future kalpas in a single pore of the body; approaching a kalyāṇamitra with the attainment of bodhisattva conduct and in each instant of mind dwelling in omniscient wisdom; approaching a kalyāṇamitra while intent on following the path and the display of miracles of the tathāgatas of the three times; approaching a kalyāṇamitra while following the path of entering the stream of all the ways of the realm of phenomena; and approaching a kalyāṇamitra without deviating from being focused on all the ways of the realm of phenomena and pervading the entire realm of phenomena.

source: དེས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ། བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་སེང་གེའི་ཁྲི་མེ་ཏོག་གི་སྙིང་པོ་ཅན་ལ་འདུག་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་ལ། མཉམ་པར་བཞག་པ་མཐོང་ངོ་། །
en: He saw the night goddess Pramudita­nayana­jagad­virocanā seated on a flower in the center of a lion throne within the circle of the assembly of the Bhagavat, resting in the bodhisattva samādhi called the banner of the power of vast, stainless, completely good joy.

source: དེའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སྦྱིན་པ་ལ་སྩོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་མངོན་པར་སྟོན་པའི་སྤྲིན་སེམས་ཅན་ཐམས་ཅད། མངོན་པར་དགའ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བལྟ་ན་ཉམས་སུ་བདེ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བལྟ་ན་སྡུག་པ་རྣམ་པ་སྣ་ཚོགས་འབྱུང་བ་ཡང་མཐོང་སྟེ། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་ཤིང་རྩོད་པ་མེད་པར་བྱ་བ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་ཕངས་པར་རྩི་བ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱོར་བ་མཚུངས་པས་ཡོངས་སུ་གཏང་བར་བྱ་བ་དང་།
en: He saw emanating from all her pores clouds of manifestations of the practice of the perfections, such as generosity, which delighted all beings, which brought pleasure to all beings, and which were various kinds of beauty for all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་སུ་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བརྙས་པ་མེད་པར་ཡོངས་སུ་གཏང་བ་དང་། ནང་དང་ཕྱིའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་དགའ་བ་ཆེན་པོ་ཡོངས་སུ་གཏང་བར་བསྟན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་བསམ་པ་ཇི་བཞིན་གྱི་སྦྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པར་བྱ་བའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ་དང་མཐུན་པའི་སྒྲས་སྦྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པའི་སྤྲིན་དང་།
en: They were like this: he saw clouds of manifestations of the practice of generosity in accord with the aspirations, perceptions, and languages of all beings, in order to benefit beings without causing discord, in order for there to be no concern for all material things, in order to give equally to all beings, in order for there to be impartiality toward all beings, in order to give respectfully to all beings, in order to give all inner and outer things, in order to manifest the generosity that is difficult, and in order to manifest in all worlds the practice of generosity according to the wishes of beings.

source: དུས་གསུམ་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཏང་བར་དཀའ་བ་ཡོངས་སུ་གཏོང་བའི་སྤྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྲིན་འཐོན་ནས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པར་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམྱིགས་པར་གྱུར་པ་མཐོང་ངོ་། །འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་གི །མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པས། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས། སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་སྐྱེ་བ་སྣ་ཚོགས་སུ་སྤྲུལ་པའི་ལུས་ཀྱི་སྤྲིན་མངོན་པར་འཐོན་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ། གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ལ་རྒྱས་པར་ཁྱབ་པར་བྱས་ནས། མངོན་སུམ་དུ་བརྟུལ་ཞུགས་ཐམས་ཅད་ཀྱི་ཡིད་དམ་ལས་མི་གཡོ་བར་ཡོངས་སུ་བསྟན་པ་དང་། སེམས་ཅན་གྱི་ཁམས་དང་མཉམ་པའི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དུ་གནས་པ་མེད་པ་དང་། ཡུལ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པ་དང་། འཁོར་བ་ཐམས་ཅད་དུ་གནས་པ་ལས་ཕྱིར་ཕྱོགས་པ་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་རྒུད་པའི་སྒོར་གཞོལ་བ་ཡོངས་སུ་སྟོན་པ་དང་། མི་སྡུག་པའི་དཀྱིལ་འཁོར་རབ་ཏུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་སྡུག་པའི་འདུ་ཤེས་ཀྱིས་ཕྱིན་ཅི་ལོག་རྣམ་པར་བཟློག་པ་དང་། མི་རྟག་པ་དང་། གཡོ་བ་དང་། འཇིག་པ་དང་། འགྱུར་བའི་ཆོས་ཉིད་ཡོངས་སུ་སྟོན་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་སྡུག་བསྔལ་ཞིང་བདག་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་གནས་པ་དང་། མི་འབྲལ་བར་མོས་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཤིན་ཏུ་དག་པར་བྱ་བའི་ཕྱིར།
en: He saw clouds of manifestations of the countless difficult acts of generosity by the bodhisattvas that appear in the three times, which being emanated were perceived by all beings within the vast extent of the worlds in the ten directions.

source: སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་བསྐུལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་གྱི་སྒྲས་ཚུལ་ཁྲིམས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་དྲི་ཞིམ་པོ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་ལུས་ཁ་དོག་སྣ་ཚོགས་སུ་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཀྱང་ཉམས་སུ་བཟོད་པ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་སྟོན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ལུས་ལ་གནོད་པར་ཐོ་བརྩམས་ཀྱང་ཉམས་སུ་བཟོད་པར་བྱེད་པ་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚུལ་དང་མི་འདྲ་བའི་ཚིག་གིས་སྤྱོ་བ་དང་། བརྒྱད་པ་དང་། སྨད་པ་དང་། བསྐྱུང་བ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་ཉམས་སུ་བཟོད་པར་བྱེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བ་ཡོངས་སུ་སྟོན་པ་དང་། རིམ་གྲོར་བྱས་པ་དང་། རིམ་གྲོར་མ་བྱས་པ་ཐམས་ཅད་ཀྱིས་མཐོ་བ་དང་དམའ་བར་མི་འགྱུར་བ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ང་རྒྱལ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་བཟོད་པ་མི་ཟད་པས་ཡེ་ཤེས་མི་ཟད་པ་ཡོངས་སུ་སྟོན་པ་དང་།
en: It was like this: because of her attainment of the inconceivable miraculous powers of the might of bodhisattvas, he saw, issuing forth from all her pores, clouds of emanated bodies of various beings, equal in number to that of all beings, which spread throughout all beings within all world realms, demonstrating directly to them the unwavering commitment to vows of discipline; demonstrating throughout the realms of beings the field of the various vows of discipline of asceticism; demonstrating nondependence on all worlds, no concern for all fields of perception, and the rejection of all locations in saṃsāra; demonstrating entering the gateway to the decline of the good fortune of devas and humans; demonstrating the field of unattractiveness; dispelling the incorrect perception of attractiveness in the world; revealing the nature of phenomena to be impermanence, instability, destruction, and change; showing the true nature of all that is composite to be suffering and the absence of a self; yearning to dwell inseparably within the field of activity of the tathāgatas; inspiring beings toward the perfectly stainless conduct of the tathāgatas; teaching to beings, in accordance with their aspirations and languages, the practice of correct conduct; manifesting the lovely scent of correct conduct that brings satisfaction to beings; and ripening all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བའི་ཕྱིར་བཟོད་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དབྱིབས་མི་སྡུག་ཅིང་། ཁ་དོག་མི་མཛེས་པའི་གཟུགས་རྣམ་པར་ཟློག་པ་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་རྣམ་པར་དག་པ་བླ་ན་མེད་པ་ཡོངས་སུ་སྟོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་སྐྱེ་བ་སྣ་ཚོགས་ཀྱི་ལུས་ཁ་དོག་དང་དབྱིབས་དང་། ཆུ་ཞེངསྣ་ཚོགས་སུ་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྒྱས་པར་ཁྱབ་པར་བྱས་ནས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཆེན་པོ་ལ་བརྩོན་འགྲུས་ཀྱིས་སྔོན་དུ་འདོར་བ། ཡང་དག་པར་སྟོན་པ་དང་། བདུད་ཀྱི་དཀྲུགས་མ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་བརྩོན་འགྲུས་དང་། བྱང་ཆུབ་ཏུ་བརྩམས་པ་མི་འཁྲུགས་མི་ཟློགས་པའི་བརྩོན་འགྲུས་དང་།
en: He saw, issuing forth from all her pores, clouds of emanated bodies of various colors, which were as numerous as all beings, teaching the endurance by all beings of the major and minor parts of their bodies being cut off; teaching the endurance by all beings of harm to their bodies; teaching the endurance by all beings of being falsely reviled, censured, reproached, disgraced, and threatened; teaching the imperturbability of all beings; teaching all beings to be neither uplifted by honors nor made downcast by disrespect; teaching humility in all beings; teaching the unceasing wisdom of the unceasing patience toward the nature of all phenomena; teaching the practice of patience that eliminates the kleśas in all beings; turning all beings away from misshapen bodies with ugly color; teaching the supreme pure color of the tathāgatas; and ripening beings.

source: སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་རྒྱ་མཚོ་ལས་རབ་ཏུ་བསྒྲལ་བའི་བརྩོན་འགྲུས་དང་མི་ཁོམ་པ་དང་ངན་སོང་དང་། ངན་འགྲོ་དང་ལོག་པར་ལྟུང་བའི་ལམ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་བརྩོན་འགྲུས་དང་། མི་ཤེས་པའི་རི་རྣམ་པར་གཏོར་བའི་བརྩོན་འགྲུས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་ཅིང་བསྙེན་བཀུར་བས་ཡོངས་སུ་མི་སྐྱོ་བའི་བརྩོན་འགྲུས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་བླང་བ་དང་། ཡོངས་སུ་བཟུང་བའི་བརྩོན་འགྲུས་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རབ་ཏུ་གཞོམ་ཞིང་རྣམ་པར་གཏོར་བའི་བརྩོན་འགྲུས་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བས་མི་སྐྱོ་བའི་བརྩོན་འགྲུས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་བརྩོན་འགྲུས་དང་། དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་རྣམ་པར་དག་པ་བླ་ན་མེད་པ་ཡོངས་སུ་སྟོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ལུས་སྣ་ཚོགས་ཁ་དོག་དང་དབྱིབས་རྣམ་པ་ཐ་དད་པར་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ། ཐབས་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཡིད་བདེ་བ་རྣམ་པར་ཟློག་པ་དང་། འདོད་པའི་དགའ་བ་ཐམས་ཅད་རྣམ་པར་སྨོད་པ་དང་། ངོ་ཚ་ཤེས་པའི་ཆོས་ཉིད་འཇིག་རྟེན་དུ་སྒྲོག་པ་དང་། དབང་པོ་བསྡམས་པ་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པ་དང་། ཚངས་པའི་སྤྱོད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་བསྔགས་པ་བྱེད་པ་དང་།
en: He saw, issuing forth from all her pores, clouds of emanated bodies of various colors, shapes, and sizes, equal in number to that of all beings, which spread everywhere in accordance with the aspirations of beings, teaching exertion in diligence for the great accumulation of omniscience; the diligence that puts to flight all discord from the māras; the diligence that is constant and unwavering in undertaking the attainment of enlightenment; the diligence for rescuing all beings from the ocean of saṃsāra; the diligence that turns beings away from all the paths that lead to unfortunate existences, calamitous existences, terrible existences, and downfalls; the diligence for shattering to pieces the mountain of ignorance; the diligence that never wearies in serving and making offerings to all the tathāgatas; the diligence for receiving and holding the Dharma wheel of all the buddhas; the diligence for shattering and scattering the mountain of all obscurations; the diligence that never wearies of ripening and guiding all beings; and the diligence for purifying all buddha realms and teaching the pure, unsurpassable diligence of the tathāgatas, and he saw them ripening beings.

source: འདོད་པའི་འཇིག་རྟེན་བདུད་ཀྱི་ཡུལ་འཇིག་པ་དང་བཅས་པར་ཡོངས་སུ་སྟོན་པ་དང་། འདོད་པའི་དགའ་བ་དང་བྲལ་བ་རྣམས་ལ་འཇིག་རྟེན་གྱི་འདོད་པ་དང་། དགའ་བའི་ཡུལ་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ལ་མོས་ཤིང་དགའ་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། མཐར་གྱིས་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་སྒོ་མངོན་པར་བསྒྲུབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་གསལ་བ་ལ་ངེས་པར་རྟོགས་པའི་སེམས་ཡོངས་སུ་རྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་། སེམས་ཅན་རྣམས་ཀྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། སྤྲོ་བ་འཕེལ་བར་བྱ་བ་དང་། ཉམས་བདེ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཡིད་མི་བདེ་བ་བཟློག་པ་དང་། སེམས་སྐྱོན་མེད་པ་ཡོངས་སུ་བསྒྲུབ་པ་དང་། སེམས་ཅན་ལས་སུ་རུང་བར་བྱ་བ་དང་། བསམ་པ་རྣམ་པར་སྦྱང་བ་དང་། དབང་པོ་གསལ་བར་བྱ་བ་དང་། ལུས་ཀྱི་བདེ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཆོས་ལ་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བ་བྱེད་ཅིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒ་ཐམས་ཅད་ནས། སྐྱེ་བ་ཐམས་ཅད་དང་འདྲ་བའི་ལུས་ཀྱི་སྤྲིན་སྣ་ཚོགས་འཐོན་ཏེ། ཞིང་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་ཆུད་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་བཞིན་དུ་བསྟན་པའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་གྱི་གན་དུ་འགྲོ་བས་སྐྱོ་བ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སློབ་དཔོན་དང་། བླ་མ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོར་བྱ་བ་དང་། བསྙེན་བཀུར་བས་སྐྱོ་བ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཡང་དག་པར་བླང་ཞིང་ཡོངས་སུ་བཟུང་བས་སྐྱོ་བ་མེད་པའི་བརྩོན་འགྲུས་ཡོངས་སུ་སྟོན་པ་དང་། སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཚུལ་ཡང་དག་པར་བརྗོད་པ་དང་། ཆོས་ཀྱི་སྒོ་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་དང་རང་བཞིན་དང་ཚུལ་མངོན་པར་བརྗོད་པ་དང་།
en: He saw, issuing forth from all her pores, clouds of emanated bodies of various colors and shapes that through various methods brought joy to beings; prevented unhappiness; condemned all delights in desire; proclaimed in the world the quality of a sense of shame; brought beings to control of their senses; praised the unsurpassable conduct of celibacy; taught the fearfulness of the world of desire and the realm of Māra; taught all the worlds that are the range of desire, even to those who were free from delighting in desires; caused beings to delight in the pleasures of the Dharma; enabled the successive attainment of the gateways to dhyāna, samādhi, and samāpatti; described the mind that comprehends the elimination of all kleśas in all beings; taught all the miraculous manifestations of the ocean of bodhisattva samādhis; taught the miracles and supremacy of the higher cognitions of the bodhisattvas; brought joy to all beings; increased enthusiasm; created happiness; dispelled unhappiness; caused the attainment of faultless minds; made minds skillful; purified thoughts; clarified the senses; brought physical bliss; magnified the power of delight in the Dharma; and thus ripened beings.
